Restructure documenation for mkdocs Github pages build
